In [2]:
import pandas as pd
import numpy as np

In [4]:
dict1 = {'a': [1,2,3], 'b':[4,5,6], 'c':[7,8,9]}

In [5]:
dict2 = {'a': [11,12,13], 'b':[14,15,16], 'c':[17,18,19]}

In [6]:
df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)

In [7]:
df1

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [8]:
df2

    a   b   c
0  11  14  17
1  12  15  18
2  13  16  19

In [9]:
pd.concat([df1,df2], axis=1)

   a  b  c   a   b   c
0  1  4  7  11  14  17
1  2  5  8  12  15  18
2  3  6  9  13  16  19

In [10]:
pd.concat([df1,df2])

    a   b   c
0   1   4   7
1   2   5   8
2   3   6   9
0  11  14  17
1  12  15  18
2  13  16  19